public class C01_DataType {
  public static void main(String[] args) {
    //데이터타입
    //bit < 4bit(Nibble) < 8bit(1byte) < 16bit(2byte)
    //변수에 타입 지정 논리형(Boolean 1byte) 바이트(1byte) 문자(2byte) 정수(Byte) 실수 문자열

    //정수 표현범위 -(2n-1) ~ (2n-1)-1
    //8bit의 표현범위
    //n=8
    //-2^(8-1) ~ 2^(8-1)-1
    //-2^7 ~ 2^7-1
    //-128 ~ 127

    //2진수
    //전원 켠다 on(1), 끈다 off(0)
    //전원스위치가 1개(On/Off)이면 표현 방법 몇가지? 2
    //사람이 사용하는 가장 작은수 0을 off상태로 표현하고 1을 on상태로 표현한다.
    //0 또는 1 1비트에 표현 숫자는 0 또는 1이라고 표현한다. Bit => Binary Term
    //10진수 2진수
    //0       0
    //1       1
    //2       10
    //3       11
    //4       100
    //5       101
    //6       110
    //7       111
    //8       1000
    //9       1001
    //10      1010

    //예) 2진수 => 4진수 => 2진수 2자리 [11]
    //문제1) 0101 1101(2)
    //       01 01 11 01
    //        1  1  3  1

    //예) 2진수 => 8진수 => 2진수 3자리 [111] 
    //예) 2진수 => 16진수 => 2진수 4자리 [1111]
    //예) 2진수 => 10진수 => 2진수 2자리 [11]



  }
}
