import React,{useState} from 'react';
import FooterComponent from './wrap/FooterComponent';
import HeaderComponent from './wrap/HeaderComponent';
import MainComponent from './wrap/MainComponent';
import '../scss/style_wrap.scss'

export default function WrapComponent (props) {

  const [state, setState] = useState(props)

  return (
    <div id='wrap'>
      <HeaderComponent />
      <MainComponent notices={state.notices}/>
      <FooterComponent />
    </div>
  );
};

WrapComponent.defaultProps = {
  notices : [
    {NO : 1, 제목 : '시스템 개선 및 서비스 점검 안내', 날짜 : '2023-02-17', 조회수 : 2804},
    {NO : 2, 제목 : '탄소중립실천포인트제 도입 안내', 날짜 : '2023-02-02', 조회수 : 18854},
    {NO : 3, 제목 : '영상정보처리기기 운영방침 / 위치정보 이용약관 / 개인정보처리방침 이용약관 개정 안내', 날짜 : '2023-02-02', 조회수 : 1962},
    {NO : 4, 제목 : '시스템 개선 및 서비스 점검 안내', 날짜 : '2023-01-27', 조회수 : 1795},
    {NO : 5, 제목 : '설 연휴 스타벅스 딜리버스 운영 안내', 날짜 : '2023-01-20', 조회수 : 8957},
    {NO : 6, 제목 : '스타벅스 카드 온라인 재충전 / e-Gift Card 구매 가능 금액 안내', 날짜 : '2023-01-19', 조회수 : 22007},
    {NO : 7, 제목 : '시스템 개선 및 서비스 점검 안내', 날짜 : '2023-01-18', 조회수 : 1367},
    {NO : 8, 제목 : '설 연휴 스타벅스 매장 영업시간 변경 안내', 날짜 : '2023-01-13', 조회수 : 7787},
    {NO : 9, 제목 : '시스템 개선 및 서비스 점검 안내', 날짜 : '2023-01-06', 조회수 : 1269},
    {NO : 10, 제목 : '스타벅스 e카드 교환권 등록 가능 금액 안내', 날짜 : '2022-12-20', 조회수 : 25341},
    {NO : 11, 제목 : '시스템 개선 및 서비스 점검 안내', 날짜 : '2022-12-16', 조회수 : 6198},
    {NO : 12, 제목 : '시스템 개선 및 서비스 점검 안내', 날짜 : '2022-12-13', 조회수 : 1304},
    {NO : 13, 제목 : '홈페이지 이용약관 / 스타벅스 카드 이용약관 개정 안내', 날짜 : '2022-12-08', 조회수 : 1786},
    {NO : 14, 제목 : '시스템 개선 및 서비스 점검 안내', 날짜 : '2022-12-02	', 조회수 : 1956},
    {NO : 15, 제목 : '시스템 개선 및 서비스 점검 안내', 날짜 : '2022-12-02', 조회수 : 1500},
    {NO : 16, 제목 : '시스템 개선 및 서비스 점검 안내', 날짜 : '2022-11-30', 조회수 : 1358},
    {NO : 17, 제목 : '시스템 개선 및 점검 안내', 날짜 : '2022-11-30', 조회수 : 929},
    {NO : 18, 제목 : '개인정보처리방침 개정 안내', 날짜 : '2022-11-10', 조회수 : 1894},
    {NO : 19, 제목 : '홈페이지 이용약관 개정 안내', 날짜 : '2022-10-28', 조회수 : 2570},
    {NO : 20, 제목 : '시스템 개선 및 점검 안내', 날짜 : '2022-10-17', 조회수 : 2102},
    {NO : 21, 제목 : '시스템 개선 및 점검 안내', 날짜 : '2022-10-11', 조회수 : 2785},
    {NO : 22, 제목 : '시스템 개선 및 서비스 점검 안내', 날짜 : '2022-10-07', 조회수 : 1845},
    {NO : 23, 제목 : '시스템 개선 및 점검 안내', 날짜 : '2022-10-06	', 조회수 : 2055},
    {NO : 24, 제목 : '시스템 개선 및 점검 안내', 날짜 : '2022-10-05	', 조회수 : 2656},
    {NO : 25, 제목 : '사이렌 오더/딜리버스 음료 기본 설정 변경 안내 (ICED → HOT)', 날짜 : '2022-10-05', 조회수 : 10295},
    {NO : 26, 제목 : '시스템 개선 및 점검 안내', 날짜 : '2022-09-23', 조회수 : 2109},
    {NO : 27, 제목 : '시스템 개선 및 점검 안내', 날짜 : '2022-09-19', 조회수 : 1564},
    {NO : 28, 제목 : '개인정보처리방침 및 영상정보처리기기 운영관리 방침 개정 안내', 날짜 : '2022-09-19', 조회수 : 2237},
    {NO : 29, 제목 : '시스템 개선 및 서비스 점검 안내', 날짜 : '2022-09-16', 조회수 : 2768},
    {NO : 30, 제목 : '고객의 소리 답변 운영 기준 변경 안내', 날짜 : '2023-02-17	', 조회수 : 15328}
  ]
}

